[
  {
    "id": "VCS-1234",
    "name": "Rimba Raya Biodiversity Reserve Project",
    "description": "A flagship REDD+ project protecting 64,000 hectares of tropical peat swamp forest in Indonesian Borneo. The project prevents planned conversion to palm oil plantations while safeguarding critical habitat for endangered Bornean orangutans, proboscis monkeys, and over 200 bird species. Local communities benefit through sustainable livelihood programs, healthcare facilities, and education initiatives serving 35 villages.",
    "methodology": "Verra VCS",
    "country": "Indonesia",
    "vintage": "2023",
    "price": 12.75,
    "available_credits": 284500,
    "category": "Forestry",
    "image_url": "https://via.placeholder.com/600x400/228B22/FFFFFF?text=Rimba+Raya+Forest",
    "buy_link": "https://www.carbonmark.com/projects/VCS-674"
  },
  {
    "id": "GS-7821",
    "name": "Tamil Nadu Wind Power Project",
    "description": "A 150 MW wind farm consisting of 75 turbines across three sites in southern India. The project displaces electricity from coal-fired power plants on the regional grid, reducing approximately 320,000 tonnes of CO2 annually. Community benefits include electrification of 12 rural villages, vocational training programs for turbine maintenance, and scholarships for 500 local students pursuing renewable energy studies.",
    "methodology": "Gold Standard",
    "country": "India",
    "vintage": "2024",
    "price": 9.40,
    "available_credits": 156000,
    "category": "Renewable Energy",
    "image_url": "https://via.placeholder.com/600x400/87CEEB/FFFFFF?text=Wind+Turbines",
    "buy_link": "https://www.carbonmark.com/projects/VCS-981"
  },
  {
    "id": "VCS-2456",
    "name": "Mikoko Pamoja Blue Carbon Mangrove Project",
    "description": "The world's first blue carbon project to successfully issue verified carbon credits, located in Gazi Bay, Kenya. The initiative protects and restores 117 hectares of coastal mangrove ecosystems that sequester carbon 4-5 times faster than terrestrial forests. The project enhances coastal resilience against storm surges and sea-level rise while supporting artisanal fisheries through improved fish nursery habitats. Revenue funds community development, including water infrastructure and women's cooperatives.",
    "methodology": "Verra VCS",
    "country": "Kenya",
    "vintage": "2023",
    "price": 18.50,
    "available_credits": 42800,
    "category": "Blue Carbon",
    "image_url": "https://via.placeholder.com/600x400/20B2AA/FFFFFF?text=Mangrove+Forest",
    "buy_link": "https://www.carbonmark.com/projects/VCS-934"
  },
  {
    "id": "CDM-9034",
    "name": "Changbin Fengli Offshore Wind Farm",
    "description": "A 109.2 MW offshore wind installation located 3-5 kilometers off the coast of Changhua County, Taiwan. Comprising 48 turbines rated at 2.3 MW each, the facility generates clean electricity for approximately 80,000 households while avoiding 195,000 tonnes of CO2 emissions annually. The project incorporates artificial reef structures around turbine foundations to enhance marine biodiversity and support sustainable fishing practices.",
    "methodology": "CDM",
    "country": "Taiwan",
    "vintage": "2022",
    "price": 8.90,
    "available_credits": 223000,
    "category": "Renewable Energy",
    "image_url": "https://via.placeholder.com/600x400/4682B4/FFFFFF?text=Offshore+Wind",
    "buy_link": "https://www.carbonmark.com/projects/VCS-1764"
  },
  {
    "id": "VCS-3187",
    "name": "Alto Mayo Protected Forest Conservation",
    "description": "A critical REDD+ initiative safeguarding 182,000 hectares of Amazon rainforest in the San Martín region of Peru. The project prevents deforestation from agricultural encroachment while protecting biodiversity hotspots containing jaguars, spectacled bears, and over 900 plant species. Sustainable development activities include organic coffee and cacao agroforestry systems benefiting 1,200 farming families, along with titling support for indigenous communities.",
    "methodology": "Verra VCS",
    "country": "Peru",
    "vintage": "2024",
    "price": 14.20,
    "available_credits": 367000,
    "category": "Forestry",
    "image_url": "https://via.placeholder.com/600x400/006400/FFFFFF?text=Amazon+Conservation",
    "buy_link": "https://www.carbonmark.com/projects/VCS-1396"
  },
  {
    "id": "GS-5629",
    "name": "Efficient Cookstoves Distribution Program - Uganda",
    "description": "A household energy project distributing 180,000 fuel-efficient cookstoves to rural communities across northern Uganda. The stoves reduce firewood consumption by 65%, cutting CO2 emissions while decreasing indoor air pollution that causes respiratory diseases. The program provides employment for 450 local artisans manufacturing the stoves and offers microfinance options for household purchases. Health benefits include reduced burns and respiratory illness, particularly benefiting women and children who manage cooking responsibilities.",
    "methodology": "Gold Standard",
    "country": "Uganda",
    "vintage": "2023",
    "price": 11.80,
    "available_credits": 89400,
    "category": "Community Projects",
    "image_url": "https://via.placeholder.com/600x400/CD853F/FFFFFF?text=Cookstoves",
    "buy_link": "https://www.carbonmark.com/projects/VCS-1764"
  },
  {
    "id": "VCS-4092",
    "name": "Cerrado Grassland Protection Initiative",
    "description": "An innovative avoided conversion project protecting 95,000 hectares of threatened Cerrado savanna ecosystem in Tocantins state, Brazil. The project prevents agricultural expansion into this biodiversity-rich biome, which harbors 5% of global species despite covering only 2% of Earth's surface. Carbon sequestration occurs through both above-ground biomass and extensive root systems storing carbon up to 6 meters deep. Community partnerships support sustainable cattle ranching practices and ecotourism development.",
    "methodology": "Verra VCS",
    "country": "Brazil",
    "vintage": "2023",
    "price": 13.60,
    "available_credits": 198000,
    "category": "Grassland Conservation",
    "image_url": "https://via.placeholder.com/600x400/DAA520/FFFFFF?text=Cerrado+Savanna",
    "buy_link": "https://www.carbonmark.com/projects/VCS-1052"
  },
  {
    "id": "GS-6843",
    "name": "Morocco Concentrated Solar Power Complex",
    "description": "A 200 MW concentrated solar power facility utilizing parabolic trough technology in the Ouarzazate region. The plant employs molten salt thermal storage, enabling electricity generation for 7 hours after sunset to meet evening peak demand. The project displaces fossil fuel generation, avoiding 385,000 tonnes of CO2 annually while demonstrating viable solar baseload power in North Africa. Local economic benefits include 800 construction jobs and 75 permanent operational positions, plus water management training programs for surrounding agricultural communities.",
    "methodology": "Gold Standard",
    "country": "Morocco",
    "vintage": "2024",
    "price": 10.25,
    "available_credits": 175000,
    "category": "Renewable Energy",
    "image_url": "https://via.placeholder.com/600x400/FF8C00/FFFFFF?text=Solar+Thermal",
    "buy_link": "https://www.carbonmark.com/projects/VCS-981"
  }
]
